## Production: ecs
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 2 to add, 2 to change, 2 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.wordpress_ecs_task_get_secret_value will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "wordpress_ecs_task_get_secret_value"  {
      ~ id      = "3412000475" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "secretsmanager:GetSecretValue"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wpml_site_key_ptvk59-WpQBaB",
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_secure_auth_salt_ptvk59-IVd2Rv",
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_secure_auth_key_ptvk59-9SWXj7",
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_nonce_salt_ptvk59-WcvWSM",
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_nonce_key_ptvk59-8KYC54",
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_logged_in_salt_ptvk59-zGhyxx",
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_logged_in_key_ptvk59-bqgc4S",
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_database_username_9shuao-3zc5KP",
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_database_password_9shuao-FA63fQ",
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_database_name_9shuao-SF8e8n",
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_database_host_9shuao-uAbPIR",
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_auth_salt_ptvk59-WeE8z7",
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_auth_key_ptvk59-3e0G4j",
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:s3_uploads_secret_ptvk59-ngOqW7",
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:s3_uploads_key_ptvk59-Z8ZEB3",
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:s3_uploads_bucket_ptvk59-YXq6Ew",
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:list_manager_endpoint_ptvk59-ngOqW7",
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:jwt_auth_secret_key_ptvk59-5wsjGD",
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:encryption_key_ptvk59-1SdDHD",
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:default_notify_api_key_ptvk59-IVd2Rv",
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:default_list_manager_api_key_ptvk59-YXq6Ew",
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:c3_aws_secret_access_key_ptvk59-VlIGTT",
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:c3_aws_access_key_id_ptvk59-Nn4jAU",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
          ~ resources     = [
              - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:default_list_manager_api_key_ptvk59-YXq6Ew",
              ~ (known after apply),
                # (22 unchanged elements hidden)
            ]
            # (2 unchanged attributes hidden)
        }
    }

  # data.template_file.wordpress_container_definition will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "wordpress_container_definition"  {
      ~ id       = "67e16fb4cf4a54a1e9dd07fd3dc639ea5fc1db9bff63d1baec5787245ac57d57" -> (known after apply)
      ~ rendered = jsonencode(
            [
              - {
                  - essential        = true
                  - image            = "472286471787.dkr.ecr.ca-central-1.amazonaws.com/platform/apache:v1.0.19"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/aws/ecs/wordpress"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "wordpress-task"
                        }
                    }
                  - name             = "apache"
                  - portMappings     = [
                      - {
                          - containerPort = 443
                          - hostPort      = 443
                          - protocol      = "tcp"
                        },
                    ]
                  - volumesFrom      = [
                      - {
                          - readOnly        = true
                          - sourceContainer = "wordpress"
                        },
                    ]
                },
              - {
                  - environment      = [
                      - {
                          - name  = "DEFAULT_DOMAIN"
                          - value = "articles.alpha.canada.ca"
                        },
                      - {
                          - name  = "S3_UPLOADS_BUCKET_URL"
                          - value = "https://articles.alpha.canada.ca"
                        },
                      - {
                          - name  = "WORDPRESS_CONFIG_EXTRA"
                          - value = "define('WP_HOME','https://articles.alpha.canada.ca');define('WP_SITEURL','https://articles.alpha.canada.ca');define('MYSQL_CLIENT_FLAGS', MYSQLI_CLIENT_SSL);"
                        },
                      - {
                          - name  = "C3_DISTRIBUTION_ID"
                          - value = "E1HX1N6D5W92G9"
                        },
                    ]
                  - essential        = true
                  - image            = "472286471787.dkr.ecr.ca-central-1.amazonaws.com/platform/wordpress:v2.18.2"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/aws/ecs/wordpress"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "wordpress-task"
                        }
                    }
                  - name             = "wordpress"
                  - portMappings     = [
                      - {
                          - containerPort = 9000
                          - hostPort      = 9000
                          - protocol      = "tcp"
                        },
                    ]
                  - secrets          = [
                      - {
                          - name      = "LIST_MANAGER_ENDPOINT"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:list_manager_endpoint_ptvk59-ngOqW7"
                        },
                      - {
                          - name      = "DEFAULT_LIST_MANAGER_API_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:default_list_manager_api_key_ptvk59-YXq6Ew"
                        },
                      - {
                          - name      = "DEFAULT_NOTIFY_API_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:default_notify_api_key_ptvk59-IVd2Rv"
                        },
                      - {
                          - name      = "ENCRYPTION_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:encryption_key_ptvk59-1SdDHD"
                        },
                      - {
                          - name      = "S3_UPLOADS_BUCKET"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:s3_uploads_bucket_ptvk59-YXq6Ew"
                        },
                      - {
                          - name      = "S3_UPLOADS_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:s3_uploads_key_ptvk59-Z8ZEB3"
                        },
                      - {
                          - name      = "S3_UPLOADS_SECRET"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:s3_uploads_secret_ptvk59-ngOqW7"
                        },
                      - {
                          - name      = "C3_AWS_ACCESS_KEY_ID"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:c3_aws_access_key_id_ptvk59-Nn4jAU"
                        },
                      - {
                          - name      = "C3_AWS_SECRET_ACCESS_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:c3_aws_secret_access_key_ptvk59-VlIGTT"
                        },
                      - {
                          - name      = "JWT_AUTH_SECRET_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:jwt_auth_secret_key_ptvk59-5wsjGD"
                        },
                      - {
                          - name      = "WPML_SITE_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wpml_site_key_ptvk59-WpQBaB"
                        },
                      - {
                          - name      = "WORDPRESS_DB_HOST"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_database_host_9shuao-uAbPIR"
                        },
                      - {
                          - name      = "WORDPRESS_DB_USER"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_database_username_9shuao-3zc5KP"
                        },
                      - {
                          - name      = "WORDPRESS_DB_PASSWORD"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_database_password_9shuao-FA63fQ"
                        },
                      - {
                          - name      = "WORDPRESS_DB_NAME"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_database_name_9shuao-SF8e8n"
                        },
                      - {
                          - name      = "WORDPRESS_AUTH_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_auth_key_ptvk59-3e0G4j"
                        },
                      - {
                          - name      = "WORDPRESS_SECURE_AUTH_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_secure_auth_key_ptvk59-9SWXj7"
                        },
                      - {
                          - name      = "WORDPRESS_LOGGED_IN_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_logged_in_key_ptvk59-bqgc4S"
                        },
                      - {
                          - name      = "WORDPRESS_NONCE_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_nonce_key_ptvk59-8KYC54"
                        },
                      - {
                          - name      = "WORDPRESS_AUTH_SALT"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_auth_salt_ptvk59-WeE8z7"
                        },
                      - {
                          - name      = "WORDPRESS_SECURE_AUTH_SALT"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_secure_auth_salt_ptvk59-IVd2Rv"
                        },
                      - {
                          - name      = "WORDPRESS_LOGGED_IN_SALT"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_logged_in_salt_ptvk59-zGhyxx"
                        },
                      - {
                          - name      = "WORDPRESS_NONCE_SALT"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_nonce_salt_ptvk59-WcvWSM"
                        },
                    ]
                },
            ]
        ) -> (known after apply)
      ~ vars     = {
          ~ "DEFAULT_LIST_MANAGER_API_KEY" = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:default_list_manager_api_key_ptvk59-YXq6Ew" -> (known after apply)
            # (32 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)
    }

  # aws_ecs_service.wordpress_service will be updated in-place
  ~ resource "aws_ecs_service" "wordpress_service" {
        id                                 = "arn:aws:ecs:ca-central-1:472286471787:service/wordpress/wordpress"
        name                               = "wordpress"
        tags                               = {
            "CostCentre" = "PlatformGCArticles"
        }
      ~ task_definition                    = "arn:aws:ecs:ca-central-1:472286471787:task-definition/wordpress:13" -> (known after apply)
        # (14 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.wordpress_task must be replaced
-/+ resource "aws_ecs_task_definition" "wordpress_task" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:472286471787:task-definition/wordpress:13" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - cpu              = 0
                  - environment      = []
                  - essential        = true
                  - image            = "472286471787.dkr.ecr.ca-central-1.amazonaws.com/platform/apache:v1.0.19"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/aws/ecs/wordpress"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "wordpress-task"
                        }
                    }
                  - mountPoints      = []
                  - name             = "apache"
                  - portMappings     = [
                      - {
                          - containerPort = 443
                          - hostPort      = 443
                          - protocol      = "tcp"
                        },
                    ]
                  - volumesFrom      = [
                      - {
                          - readOnly        = true
                          - sourceContainer = "wordpress"
                        },
                    ]
                },
              - {
                  - cpu              = 0
                  - environment      = [
                      - {
                          - name  = "C3_DISTRIBUTION_ID"
                          - value = "E1HX1N6D5W92G9"
                        },
                      - {
                          - name  = "DEFAULT_DOMAIN"
                          - value = "articles.alpha.canada.ca"
                        },
                      - {
                          - name  = "S3_UPLOADS_BUCKET_URL"
                          - value = "https://articles.alpha.canada.ca"
                        },
                      - {
                          - name  = "WORDPRESS_CONFIG_EXTRA"
                          - value = "define('WP_HOME','https://articles.alpha.canada.ca');define('WP_SITEURL','https://articles.alpha.canada.ca');define('MYSQL_CLIENT_FLAGS', MYSQLI_CLIENT_SSL);"
                        },
                    ]
                  - essential        = true
                  - image            = "472286471787.dkr.ecr.ca-central-1.amazonaws.com/platform/wordpress:v2.18.2"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/aws/ecs/wordpress"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "wordpress-task"
                        }
                    }
                  - mountPoints      = []
                  - name             = "wordpress"
                  - portMappings     = [
                      - {
                          - containerPort = 9000
                          - hostPort      = 9000
                          - protocol      = "tcp"
                        },
                    ]
                  - secrets          = [
                      - {
                          - name      = "LIST_MANAGER_ENDPOINT"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:list_manager_endpoint_ptvk59-ngOqW7"
                        },
                      - {
                          - name      = "DEFAULT_LIST_MANAGER_API_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:default_list_manager_api_key_ptvk59-YXq6Ew"
                        },
                      - {
                          - name      = "DEFAULT_NOTIFY_API_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:default_notify_api_key_ptvk59-IVd2Rv"
                        },
                      - {
                          - name      = "ENCRYPTION_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:encryption_key_ptvk59-1SdDHD"
                        },
                      - {
                          - name      = "S3_UPLOADS_BUCKET"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:s3_uploads_bucket_ptvk59-YXq6Ew"
                        },
                      - {
                          - name      = "S3_UPLOADS_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:s3_uploads_key_ptvk59-Z8ZEB3"
                        },
                      - {
                          - name      = "S3_UPLOADS_SECRET"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:s3_uploads_secret_ptvk59-ngOqW7"
                        },
                      - {
                          - name      = "C3_AWS_ACCESS_KEY_ID"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:c3_aws_access_key_id_ptvk59-Nn4jAU"
                        },
                      - {
                          - name      = "C3_AWS_SECRET_ACCESS_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:c3_aws_secret_access_key_ptvk59-VlIGTT"
                        },
                      - {
                          - name      = "JWT_AUTH_SECRET_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:jwt_auth_secret_key_ptvk59-5wsjGD"
                        },
                      - {
                          - name      = "WPML_SITE_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wpml_site_key_ptvk59-WpQBaB"
                        },
                      - {
                          - name      = "WORDPRESS_DB_HOST"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_database_host_9shuao-uAbPIR"
                        },
                      - {
                          - name      = "WORDPRESS_DB_USER"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_database_username_9shuao-3zc5KP"
                        },
                      - {
                          - name      = "WORDPRESS_DB_PASSWORD"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_database_password_9shuao-FA63fQ"
                        },
                      - {
                          - name      = "WORDPRESS_DB_NAME"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_database_name_9shuao-SF8e8n"
                        },
                      - {
                          - name      = "WORDPRESS_AUTH_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_auth_key_ptvk59-3e0G4j"
                        },
                      - {
                          - name      = "WORDPRESS_SECURE_AUTH_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_secure_auth_key_ptvk59-9SWXj7"
                        },
                      - {
                          - name      = "WORDPRESS_LOGGED_IN_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_logged_in_key_ptvk59-bqgc4S"
                        },
                      - {
                          - name      = "WORDPRESS_NONCE_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_nonce_key_ptvk59-8KYC54"
                        },
                      - {
                          - name      = "WORDPRESS_AUTH_SALT"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_auth_salt_ptvk59-WeE8z7"
                        },
                      - {
                          - name      = "WORDPRESS_SECURE_AUTH_SALT"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_secure_auth_salt_ptvk59-IVd2Rv"
                        },
                      - {
                          - name      = "WORDPRESS_LOGGED_IN_SALT"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_logged_in_salt_ptvk59-zGhyxx"
                        },
                      - {
                          - name      = "WORDPRESS_NONCE_SALT"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_nonce_salt_ptvk59-WcvWSM"
                        },
                    ]
                  - volumesFrom      = []
                },
            ]
        ) -> (known after apply) # forces replacement
      ~ id                       = "wordpress" -> (known after apply)
      ~ revision                 = 13 -> (known after apply)
        tags                     = {
            "CostCentre" = "PlatformGCArticles"
        }
        # (8 unchanged attributes hidden)
    }

  # aws_iam_policy.wordpress_ecs_task_get_secret_value will be updated in-place
  ~ resource "aws_iam_policy" "wordpress_ecs_task_get_secret_value" {
        id        = "arn:aws:iam::472286471787:policy/WordpressEcsTaskGetSecretValue"
        name      = "WordpressEcsTaskGetSecretValue"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "secretsmanager:GetSecretValue"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wpml_site_key_ptvk59-WpQBaB",
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_secure_auth_salt_ptvk59-IVd2Rv",
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_secure_auth_key_ptvk59-9SWXj7",
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_nonce_salt_ptvk59-WcvWSM",
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_nonce_key_ptvk59-8KYC54",
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_logged_in_salt_ptvk59-zGhyxx",
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_logged_in_key_ptvk59-bqgc4S",
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_database_username_9shuao-3zc5KP",
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_database_password_9shuao-FA63fQ",
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_database_name_9shuao-SF8e8n",
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_database_host_9shuao-uAbPIR",
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_auth_salt_ptvk59-WeE8z7",
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_auth_key_ptvk59-3e0G4j",
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:s3_uploads_secret_ptvk59-ngOqW7",
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:s3_uploads_key_ptvk59-Z8ZEB3",
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:s3_uploads_bucket_ptvk59-YXq6Ew",
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:list_manager_endpoint_ptvk59-ngOqW7",
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:jwt_auth_secret_key_ptvk59-5wsjGD",
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:encryption_key_ptvk59-1SdDHD",
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:default_notify_api_key_ptvk59-IVd2Rv",
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:default_list_manager_api_key_ptvk59-YXq6Ew",
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:c3_aws_secret_access_key_ptvk59-VlIGTT",
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:c3_aws_access_key_id_ptvk59-Nn4jAU",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {}
        # (4 unchanged attributes hidden)
    }

  # aws_secretsmanager_secret_version.default_list_manager_api_key must be replaced
-/+ resource "aws_secretsmanager_secret_version" "default_list_manager_api_key" {
      ~ arn            = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:default_list_manager_api_key_ptvk59-YXq6Ew" -> (known after apply)
      ~ id             = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:default_list_manager_api_key_ptvk59-YXq6Ew|EE4BD83F-AA6D-4F90-9C29-B1D75409B45B" -> (known after apply)
      - secret_binary  = (sensitive value)
      ~ secret_string  = (sensitive value) # forces replacement
      ~ version_id     = "EE4BD83F-AA6D-4F90-9C29-B1D75409B45B" -> (known after apply)
      ~ version_stages = [
          - "AWSCURRENT",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 2 to add, 2 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>